RDVMI.rdvmi-ext/src/InformationRegisters/рдв_РегистрацияИзменений/рдв_РегистрацияИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_РегистрацияИзменений</name>
  <resources>
    <name>ВыгружаемыйОбъект</name>
    <type>
      <types>CatalogRef.рдв_ВыгружаемыеОбъекты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.рдв_СтатусыРегистрацииИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаРегистрацииВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/Enums/рдв_СтатусыРегистрацииИзменений/рдв_СтатусыРегистрацииИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_СтатусыРегистрацииИзменений</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_РегистрацияИзменений/ManagerModule.bsl
Функция ЗарегистрироватьИзменениеОбъекта(ВыгружаемыйОбъект, ПравилоРегистрации, ИдентификаторСобытия = Неопределено) Экспорт
	
	ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор);
	Если ИдентификаторСобытия = Неопределено Тогда
		ИдентификаторСобытия = ИдентификаторСообщения;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись = РегистрыСведений.рдв_РегистрацияИзменений.СоздатьМенеджерЗаписи();
	Запись.ДатаРегистрацииВМиллисекундах = ТекущаяДатаВМиллисекундах;
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ИдентификаторСобытия = ИдентификаторСобытия;
	Запись.ВыгружаемыйОбъект = ВыгружаемыйОбъект;
	Запись.ДатаРегистрации = ТекущаяДата;
	Запись.Статус = Перечисления.рдв_СтатусыРегистрацииИзменений.Новое;
	Запись.ВнешняяСистема = ПравилоРегистрации.ВнешняяСистема;
	Запись.АдресМетода = ПравилоРегистрации.АдресМетода;
	Запись.Интерфейс = ПравилоРегистрации.Интерфейс;
	Запись.ВидСообщения = ПравилоРегистрации.ВидСообщения;
	
	Запись.Записать();
	
	Возврат ИдентификаторСообщения;
	
КонецФункции

Процедура ОбновитьСтатусРегистрации(ИдентификаторСообщения, Статус, ТекстОшибки = "") Экспорт
	
	НачатьТранзакцию();

	Попытка;
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.рдв_РегистрацияИзменений");
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторСообщения", ИдентификаторСообщения);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();	
		
		НаборЗаписей = РегистрыСведений.рдв_РегистрацияИзменений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
			Запись.Статус = Статус;
			Запись.ТекстОшибки = ТекстОшибки;
		КонецЕсли;
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
		
	
КонецПроцедуры

Процедура УдалитьРегистрацию(ИдентификаторСообщения, ВыгружаемыйОбъект) Экспорт

	НачатьТранзакцию();
	Попытка;
		НаборЗаписей = РегистрыСведений.рдв_РегистрацияИзменений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		НаборЗаписей.Записать();
		УдаляемыйОбъект = ВыгружаемыйОбъект.ПолучитьОбъект();
		УдаляемыйОбъект.Удалить();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры
